#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0724aacec3a49e2ef]
aws_route53_zone.public: Refreshing state... [id=Z02656311K1COJYMC68ZU]
data.aws_availability_zones.available: Reading...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:eu-west-1:294268556398:certificate/ca4273d6-ac62-4c10-8f2d-c336af54df53]
aws_iam_role.this: Refreshing state... [id=ssm_role]
aws_iam_role_policy_attachment.this[1]: Refreshing state... [id=ssm_role-20230608162355674900000004]
aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=ssm_role-20230608162355474100000003]
aws_iam_instance_profile.this: Refreshing state... [id=ssm_profile]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_route53_record.this["phpmyadmin.ashley.aws.crlabs.cloud"]: Refreshing state... [id=Z02656311K1COJYMC68ZU__7de4954a625e4597cbdea39929c99f11.phpmyadmin.ashley.aws.crlabs.cloud._CNAME]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-06-09 10:02:08.283 +0000 UTC]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b864136fe2515278]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04e047c82e4b29f98]
aws_lb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:targetgroup/phpmyadmin/3d5c61373b4a9a44]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-07e860a4e9b1952f2]
aws_security_group.lb: Refreshing state... [id=sg-017f7acf0f506590e]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05dbcecc677b875de]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bf4d602239bbcbf8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09bff2412d460c0b2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-07be113b7f0c2a4b0]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07f01dd6ba48b2c99]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f1351f2645c43efa]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-09cd077178f2471d3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-069cf6d1ee014b306]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c7e79b5053f7b08a]
aws_security_group.pgadmin: Refreshing state... [id=sg-091bd3cfe36bef988]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a9dac1f9fc384e1b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-07be113b7f0c2a4b01080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fab53f78d26c6008]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-017843cb42e3d5986]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e786c6372babb348]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09cd2923d39db71e6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08b30fe318ef03b52]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05b63a23358801b44]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-049ac44353ca9b830]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:loadbalancer/app/migration-alb/086a6ea9fb865178]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bf4d602239bbcbf81080289494]
aws_route53_record.lb: Refreshing state... [id=Z02656311K1COJYMC68ZU_phpmyadmin.ashley.aws.crlabs.cloud_A]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:listener/app/migration-alb/086a6ea9fb865178/832d2976f07580c0]
aws_lb_listener_certificate.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:294268556398:listener/app/migration-alb/086a6ea9fb865178/832d2976f07580c0_arn:aws:acm:eu-west-1:294268556398:certificate/ca4273d6-ac62-4c10-8f2d-c336af54df53]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.ebs will be created
  + resource "aws_kms_key" "ebs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "This key is used to encrypt ebs volumes"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Name" = "ebs-key"
        }
      + tags_all                           = {
          + "Name" = "ebs-key"
        }
    }

  # aws_security_group.replication will be created
  + resource "aws_security_group" "replication" {
      + arn                    = (known after apply)
      + description            = "Allow 443 inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Outbound open"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "443 for replication"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "replication_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "replication_sg"
        }
      + tags_all               = {
          + "Name" = "replication_sg"
        }
      + vpc_id                 = "vpc-0724aacec3a49e2ef"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ash-ley, Action: `pull_request`, Working Directory: ` migration/ `, Workflow: `Terraform Validation`*